Documents/АктОРасхожденияхПослеОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>АктОРасхожденияхПослеОтгрузки</Name>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВзаиморасчетов</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВзаиморасчетов</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВключенВСтоимость</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыАктаОРасхождениях</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВНалоговомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатурыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийАктОРасхожденияхПослеОтгрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDСкладаСобственныйСклад</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СобственныеСклады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДДокументаВСмежнойБазе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВСтороннейБазе</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВСтороннейБазе</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПоДокументу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРасхождения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пересорт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Брак</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийМенеджера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийПокупателя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоДокументу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРасхождения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСПоДокументу</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСРасхождения</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасхожденияКМ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасхожденияКМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Недостача</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Излишек</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОперацийАктОРасхожденияхПослеОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийАктОРасхожденияхПослеОтгрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыАктаОРасхождениях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыАктаОРасхождениях</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отработано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтработаноВУТ11</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаКонтроле</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласовано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АктОРасхожденияхПослеОтгрузки/Ext/ObjectModule.bsl
Перем мВалютаРегламентированногоУчета Экспорт;
Перем мПорядокСписанияПартий; // (Общ)
Перем мПараметрыСвязиСтрокТЧ Экспорт;
Перем мСтруктураПараметровВзаиморасчетов Экспорт;
Перем мСтруктураПараметровДляПолученияДоговора Экспорт;
Перем мУдалятьДвижения;
Перем мУказаниеСкладовВТЧ Экспорт;


Процедура ОбработкаЗаполнения(Основание)
	
	Если Основание = Неопределено ИЛИ  ТипЗнч(Основание) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Возврат;
	КонецЕсли;                                                    	
	
	ДокументОснование = Основание;                                	
	ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
	ВидОперации = ?(Организация.ИНН = Контрагент.ИНН, Перечисления.ВидыОперацийАктОРасхожденияхПослеОтгрузки.Перемещение, Перечисления.ВидыОперацийАктОРасхожденияхПослеОтгрузки.Продажа);
	Статус = Перечисления.СтатусыАктаОРасхождениях.Создан;
	
	СкопироватьТовары(ДокументОснование); 	
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ОтражатьВУправленческомУчете", Основание.Метаданные()) Тогда
		ОтражатьВУправленческомУчете = Основание.ОтражатьВУправленческомУчете;
	Иначе
		ОтражатьВУправленческомУчете = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОтражатьДокументыВУправленческомУчете");
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ОтражатьВБухгалтерскомУчете", Основание.Метаданные()) Тогда
		ОтражатьВБухгалтерскомУчете = Основание.ОтражатьВБухгалтерскомУчете;
		ОтражатьВНалоговомУчете     = Основание.ОтражатьВНалоговомУчете;
	Иначе
		ОтражатьВБухгалтерскомУчете = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОтражатьДокументыВБухгалтерскомУчете");
		
		Если ОтражатьВБухгалтерскомУчете Тогда
			ОтражатьВНалоговомУчете = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОтражатьДокументыВНалоговомУчете");
		Иначе
			ОтражатьВНалоговомУчете = ОтражатьВБухгалтерскомУчете;
		КонецЕсли;
		
	КонецЕсли;   

КонецПроцедуры

Процедура ЗаполнитьРасхожденияКМ() Экспорт
	
	// Выставляем признак расхождения в тч Товары
    ПолученыДанныеПоКМ = Ложь;
	
	Для Каждого СтрокаТовары Из Товары Цикл
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовары.Номенклатура, "ТребуетсяМаркировка") = Ложь Тогда
			
			СтрокаТовары.РасхожденияКМ = Ложь;
			Продолжить;
			
		КонецЕсли;
		
		Если НЕ ПолученыДанныеПоКМ Тогда
			
			// если есть позиции по ЧЗ, перезаполняем
			Запрос = Новый Запрос;
			Запрос.Текст = Документы.АктОРасхожденияхПослеОтгрузки.ПолучитьТекстЗапросаПоКодамМаркировки();
			
			Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
			Запрос.УстановитьПараметр("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
			Запрос.УстановитьПараметр("ТаблицаРасхожденияКМ", РасхожденияКМ.Выгрузить());
			
			РезультатЗапроса = Запрос.ВыполнитьПакет();
			тзКодыМаркировки = РезультатЗапроса[2].Выгрузить();
			
			тзКодыМаркировки.Свернуть("Номенклатура", "КоличествоПринято, КоличествоИзлишек, КоличествоНедостача");
			
			ПолученыДанныеПоКМ = Истина;
			
		КонецЕсли;
		
		КоличествоПоДокументам = СтрокаТовары.КоличествоПоДокументу;
		
		НайденнаяСтрокаПоНоменклатуреКМ = тзКодыМаркировки.Найти(СтрокаТовары.Номенклатура, "Номенклатура");	
		
		Если НайденнаяСтрокаПоНоменклатуреКМ = Неопределено Тогда
			
			СтрокаТовары.РасхожденияКМ = Ложь;
			Продолжить;
			
		КонецЕсли;
		
		Если НайденнаяСтрокаПоНоменклатуреКМ.КоличествоПринято > КоличествоПоДокументам Тогда
			
			// хватило принятых
			НайденнаяСтрокаПоНоменклатуреКМ.КоличествоПринято = НайденнаяСтрокаПоНоменклатуреКМ.КоличествоПринято - КоличествоПоДокументам;
			
		ИначеЕсли НайденнаяСтрокаПоНоменклатуреКМ.КоличествоПринято < КоличествоПоДокументам Тогда
			
			// не хватило принятых
			НайденнаяСтрокаПоНоменклатуреКМ.КоличествоПринято = 0;
			СтрокаТовары.РасхожденияКМ = Истина;
			
		ИначеЕсли НайденнаяСтрокаПоНоменклатуреКМ.КоличествоПринято = КоличествоПоДокументам И 
			(НайденнаяСтрокаПоНоменклатуреКМ.КоличествоИзлишек <> 0 ИЛИ НайденнаяСтрокаПоНоменклатуреКМ.КоличествоНедостача <> 0) Тогда
			
			// хватило принятых, но есть другие отклонения
			НайденнаяСтрокаПоНоменклатуреКМ.КоличествоПринято = 0;
			СтрокаТовары.РасхожденияКМ = Истина;
			
		КонецЕсли;	
			
	КонецЦикла;
	
КонецПроцедуры


// Процедура выполняет копирование табличной части заказа поставщику в документ.
//
Процедура СкопироватьТовары(Основание = Неопределено) Экспорт
	
	КурсДокумента      = ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	КратностьДокумента = ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета);
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		ДокументОснование = Основание;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РТУ", Основание);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Номенклатура,
	|	РеализацияТоваровУслугТовары.Количество,
	|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК КоличествоПоДокументу,
	|	СУММА(РеализацияТоваровУслугТовары.Сумма) КАК Сумма,
	|	РеализацияТоваровУслугТовары.Сумма КАК СуммаПоДокументу,
	|	МАКСИМУМ(РеализацияТоваровУслугТовары.СтавкаНДС) КАК СтавкаНДС,
	|	СУММА(РеализацияТоваровУслугТовары.СуммаНДС) КАК СуммаНДС,
	|	РеализацияТоваровУслугТовары.СуммаНДС КАК СуммаНДСПоДокументу,
	|	МАКСИМУМ(РеализацияТоваровУслугТовары.СерияНоменклатуры) КАК СерияНоменклатуры,
	|	РеализацияТоваровУслугТовары.КлючСтроки,
	|	ВЫРАЗИТЬ(РеализацияТоваровУслугТовары.Сумма / РеализацияТоваровУслугТовары.Количество КАК ЧИСЛО(15, 2)) КАК Цена,
	|	РеализацияТоваровУслугТовары.НомерСтроки,
	|	РеализацияТоваровУслугТовары.ЗаказПокупателя
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &РТУ
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугТовары.Номенклатура,
	|	РеализацияТоваровУслугТовары.КлючСтроки,
	|	РеализацияТоваровУслугТовары.Количество,
	|	РеализацияТоваровУслугТовары.Сумма,
	|	РеализацияТоваровУслугТовары.СуммаНДС,
	|	РеализацияТоваровУслугТовары.НомерСтроки,
	|	РеализацияТоваровУслугТовары.ЗаказПокупателя
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеализацияТоваровУслугТовары.НомерСтроки
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблЧасть = РезультатЗапроса.Скопировать();
	ТоварыТаблЧасти = ТаблЧасть.Скопировать();
	ТоварыТаблЧасти.Свернуть("Номенклатура");
	
	Если НЕ ТоварыТаблЧасти.Количество() = 0 Тогда
		
		Для Каждого СтрокаДобавитьВТЧ Из ТаблЧасть Цикл
			
			СтрокаТабличнойЧасти = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтрокаДобавитьВТЧ);
			СтрокаТабличнойЧасти.Склад = Склад;
			СтрокаТабличнойЧасти.КоличествоРасхождения = СтрокаТабличнойЧасти.Количество - СтрокаТабличнойЧасти.КоличествоПоДокументу;
			ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			
			СтруктураШапкиДокумента = Новый Структура("Контрагент, ТипЦен, ДоговорКонтрагента, ДатаДокумента, ВалютаДокумента, УчитыватьНДС, СуммаВключаетНДС",
			Контрагент, ТипЦен, ДоговорКонтрагента, Дата,ВалютаДокумента, УчитыватьНДС,СуммаВключаетНДС);
			ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПокупкиТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета); 
			
			// Рассчитываем реквизиты табличной части.
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			
			ОбработкаТабличныхЧастей.РассчитатьСуммуРасхожденияТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСРасхожденияТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаполнитьРасхожденияКМ();
	
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		
		Если НЕ ЗначениеЗаполнено(Статус) Тогда 
			
			Отказ = Истина;
			Сообщить("Не заполнен ""Статус"" !", СтатусСообщения.Важное);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#Если Клиент Тогда
	
Функция ПечатьАктаОРасхождениях()
	
	ТабДокумент  = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("АктОРасхождениях");
			
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект);
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Контрагент = Контрагент;
	ОбластьШапка.Параметры.Организация = Организация;
	ОбластьШапка.Параметры.Филиал = Константы.База.Получить();
	ОбластьШапка.Параметры.Склад = Склад;
	ОбластьШапка.Параметры.Распоряжение = ДокументОснование;
	ТабДокумент.Вывести(ОбластьШапка);		
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	АктОРасхожденияхПослеОтгрузкиТовары.НомерСтроки,
	|	АктОРасхожденияхПослеОтгрузкиТовары.Номенклатура,
	|	АктОРасхожденияхПослеОтгрузкиТовары.КоличествоПоДокументу,
	|	АктОРасхожденияхПослеОтгрузкиТовары.Количество КАК КоличествоПоФакту,
	|	АктОРасхожденияхПослеОтгрузкиТовары.КоличествоРасхождения,
	|	АктОРасхожденияхПослеОтгрузкиТовары.ЕдиницаИзмерения
	|ИЗ
	|	Документ.АктОРасхожденияхПослеОтгрузки.Товары КАК АктОРасхожденияхПослеОтгрузкиТовары
	|ГДЕ
	|	АктОРасхожденияхПослеОтгрузкиТовары.Ссылка = &Ссылка
	|	И АктОРасхожденияхПослеОтгрузкиТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ОприходоватьСейчас)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
					
	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");	
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицы.Параметры, Выборка); 
		ТабДокумент.Вывести(ОбластьСтрокаТаблицы);		
		
	КонецЦикла;
	
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ТабДокумент.Вывести(ОбластьПодвалТаблицы);
	
	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
	ТабДокумент.Вывести(ОбластьПодписи);
			 
	//ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.АвтоМасштаб = Истина;
	Возврат ТабДокумент;
	
КонецФункции
	
// Процедура осуществляет печать документа. Можно направить печать на 
	// экран или принтер, а также распечатать необходмое количество копий.
	//
	//  Название макета печати передается в качестве параметра,
	// по переданному названию находим имя макета в соответствии.
	//
	// Параметры:
	//  НазваниеМакета - строка, название макета.
	//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
		
	Если ЭтоНовый() Тогда
		
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
		
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
		
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	// Получить экземпляр документа на печать
	Если ИмяМакета = "АктОРасхождениях" Тогда
		ТабДокумент = ПечатьАктаОРасхождениях();					
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);
		
КонецПроцедуры // Печать
	
#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;	
	СтруктураМакетов.Вставить("АктОРасхождениях", "Акт о расхождениях");
		
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Функция ОформитьДокументы() Экспорт
	
	//+Макрушин Е. 03.03.2026 #UT10-5689
	Отказ = Ложь;
	
	ДокРТУ = ДокументОснование.ПолучитьОбъект();
	соотДокументыСборки = Новый Соответствие;

	Если ВидОперации = Перечисления.ВидыОперацийАктОРасхожденияхПослеОтгрузки.Перемещение Тогда
		
		СкорректироватьРТУ(ДокРТУ, Отказ);
		 
		// далее изменения только по недостачам
		СкорректироватьСборки(соотДокументыСборки, Отказ);
		
		Если Отказ Тогда
			Возврат Ложь;
		КонецЕсли;	
		
		Попытка
	
			НачатьТранзакцию();
			
			// записываем все измененные объекты

			ДокРТУ.Записать(?(ДокРТУ.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
			
			Для Каждого ЭлДокументыСборки Из соотДокументыСборки Цикл
				
				ДокКорректировкаСборки = ЭлДокументыСборки.Значение;
				
				Если ДокКорректировкаСборки.Товары.Количество() > 0 Тогда
					
					ДокКорректировкаСборки.Записать(РежимЗаписиДокумента.Проведение);
					ДокКорректировкаСборки.СоздатьКорректировкиЗаказа();
					
				КонецЕсли;
				
			КонецЦикла;
			
		Исключение       
			
			ОтменитьТранзакцию();
			ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
		КонецПопытки;
		
		ЗафиксироватьТранзакцию();

        Возврат Истина;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийАктОРасхожденияхПослеОтгрузки.Продажа Тогда
		
		ДокКорректировкаРеализации = СоздатьКорректировкуРеализации(Отказ);
		
		Если Отказ Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Попытка
	
			НачатьТранзакцию();
			
			ДокКорректировкаРеализации.Записать(?(ДокРТУ.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
			
		Исключение       
			
			ОтменитьТранзакцию();
			ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
		КонецПопытки;
		
		ЗафиксироватьТранзакцию();

        Возврат Истина;
		
	КонецЕсли;
	//-Макрушин Е. 03.03.2026 #UT10-5689
	
КонецФункции

Процедура СкорректироватьРТУ(ДокРТУ, Отказ)
	
	//+Макрушин Е. 10.03.2026 #UT10-5689
	Для каждого СтрокаТовары Из Товары Цикл
	
		Если СтрокаТовары.КоличествоРасхождения < 0 Тогда
			
			//недостача
			ЕстьНедостача = Истина;
			
			ОбщееКоличествоКИзменению = -СтрокаТовары.КоличествоРасхождения;
			СтрокиРеализации = ДокРТУ.Товары.НайтиСтроки(Новый Структура("Номенклатура, ЗаказПокупателя", СтрокаТовары.Номенклатура, СтрокаТовары.ЗаказПокупателя)); 
			
			Для Каждого СтрокаРеализации Из СтрокиРеализации Цикл
				
				КоличествоКИзменению = Мин(СтрокаРеализации.Количество, ОбщееКоличествоКИзменению);
				
				СтрокаРеализации.Количество = СтрокаРеализации.Количество - КоличествоКИзменению;
				ОбщееКоличествоКИзменению = ОбщееКоличествоКИзменению - КоличествоКИзменению;
				
				Если СтрокаРеализации.Количество = 0 Тогда
					ДокРТУ.Товары.Удалить(СтрокаРеализации);
				Иначе
					
					ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаРеализации, ДокРТУ);
					ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаРеализации, ДокРТУ);
					ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаРеализации, ДокРТУ);
					
				КонецЕсли;
				
				Если ОбщееКоличествоКИзменению = 0 Тогда
					Прервать;
				КонецЕсли;	
				
			КонецЦикла;
			
			Если ОбщееКоличествоКИзменению <> 0 Тогда
				
				ОбщегоНазначения.СообщитьОбОшибке("Не удалось скорректировать " + ДокументОснование + " по номенклатуре " 
					+ СтрокаТовары.Номенклатура + " и заказу " + СтрокаТовары.ЗаказПокупателя 
					+ " на -"  + ОбщееКоличествоКИзменению + " " + СтрокаТовары.ЕдиницаИзмерения, Отказ); 
					
			КонецЕсли;
			
		ИначеЕсли СтрокаТовары.КоличествоРасхождения > 0 Тогда
			
			//излишек
			НовСтрокаТоварыРТУ = ДокРТУ.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрокаТоварыРТУ, СтрокаТовары);
			НовСтрокаТоварыРТУ.ЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();
			НовСтрокаТоварыРТУ.СпособСписанияОстаткаТоваров = Перечисления.СпособыСписанияОстаткаТоваров.СоСклада;
			НовСтрокаТоварыРТУ.Количество = СтрокаТовары.КоличествоРасхождения;
			
			ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(НовСтрокаТоварыРТУ, ДокРТУ);
			ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(НовСтрокаТоварыРТУ, ДокРТУ);
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НовСтрокаТоварыРТУ, ДокРТУ);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НовСтрокаТоварыРТУ, ДокРТУ);
					
		КонецЕсли;
		
	КонецЦикла;
	
	// корректируем КМ в РТУ по акту
	Для Каждого СтрокаРасхожденияКМ Из РасхожденияКМ Цикл
		
		Если СтрокаРасхожденияКМ.Недостача Тогда
			
			ЕстьНедостача = Истина;
			НайденнаяСтрокаКМПоНедостаче = ДокРТУ.КодыМаркировки.Найти(СтрокаРасхожденияКМ.КодМаркировки, "КодМаркировки");
			
			Если НайденнаяСтрокаКМПоНедостаче <> Неопределено Тогда
				ДокРТУ.КодыМаркировки.Удалить(НайденнаяСтрокаКМПоНедостаче);
			Иначе
				ОбщегоНазначения.СообщитьОбОшибке("Не удалось скорректировать " + ДокументОснование + " по коду маркировки " + СтрокаРасхожденияКМ.КодМаркировки, Отказ);	
			КонецЕсли;
			
		ИначеЕсли СтрокаРасхожденияКМ.Излишек Тогда
			
			НовСтрокаКМ = ДокРТУ.КодыМаркировки.Добавить();
			НовСтрокаКМ.КодМаркировки = СтрокаРасхожденияКМ.КодМаркировки;
			
		КонецЕсли;
		
	КонецЦикла;
	//-Макрушин Е. 10.03.2026 #UT10-5689
	
КонецПроцедуры

Процедура СкорректироватьСборки(соотДокументыСборки, Отказ)
	
	//+Макрушин Е. 10.03.2026 #UT10-5689
	ЯчейкаДляПеремещенияОтказовКлиентов = Константы.ЯчейкаДляПеремещенияОтказовКлиентов.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаРасхожденияДляКорректировкиСборокЗаказовПокупатей();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	
	тзНедостачиКМ = РезультатПакет[1].Выгрузить();
	тзНедостачиТовары = РезультатПакет[2].Выгрузить();
	тзНедостачиСборки = РезультатПакет[4].Выгрузить();
	
	Для Каждого СтрокаНедостачиТовары Из тзНедостачиТовары Цикл
		
		СтруктураОтбораНоменклатураЗаказ = Новый Структура;
		СтруктураОтбораНоменклатураЗаказ.Вставить("Номенклатура", СтрокаНедостачиТовары.Номенклатура);
		СтруктураОтбораНоменклатураЗаказ.Вставить("ЗаказПокупателя", СтрокаНедостачиТовары.ЗаказПокупателя);
		
		СтрокиНедостачиСборки = тзНедостачиСборки.НайтиСтроки(СтруктураОтбораНоменклатураЗаказ);
		
		Для Каждого СтрокаНедостачиСборки Из СтрокиНедостачиСборки Цикл 
		
			ДокКорректировкаСборки = соотДокументыСборки.Получить(СтрокаНедостачиСборки.ДокументСборкаСсылка);
			
			Если ДокКорректировкаСборки = Неопределено Тогда
				
				ДокКорректировкаСборки = Документы.КорректировкаСборкиЗаказовПокупателя.СоздатьДокумент();
				ДокКорректировкаСборки.СборкаЗаказовПокупателя = СтрокаНедостачиСборки.ДокументСборкаСсылка;
				ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ДокКорректировкаСборки, ДокКорректировкаСборки.СборкаЗаказовПокупателя);
				ДокКорректировкаСборки.Грузополучатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаНедостачиСборки.ДокументСборкаСсылка, "Грузополучатель");
				ДокКорректировкаСборки.Дата = ТекущаяДата();
				ДокКорректировкаСборки.Исполнено = Истина;
				ДокКорректировкаСборки.ОткорректированНеСобранным = Истина;
				ДокКорректировкаСборки.Ответственный = Пользователи.ТекущийПользователь().ФизЛицо;
				ДокКорректировкаСборки.УстановитьНовыйНомер(ДокКорректировкаСборки.Организация.Префикс);
				
				// отработаем все КМ по этому документу сборки
				ПодходящиеСтрокиКМ = тзНедостачиКМ.НайтиСтроки(Новый Структура("ДокументСборкаСсылка", СтрокаНедостачиСборки.ДокументСборкаСсылка));
				
				Для Каждого ПодходящаяСтрокаКМ Из ПодходящиеСтрокиКМ Цикл
					
					НовСтрокаКодыМаркировки = ДокКорректировкаСборки.КодыМаркировки.Добавить();
					НовСтрокаКодыМаркировки.КодМаркировки = ПодходящаяСтрокаКМ.КодМаркировки;
					
					тзНедостачиКМ.Удалить(ПодходящаяСтрокаКМ);
		
				КонецЦикла;
				
				соотДокументыСборки.Вставить(СтрокаНедостачиСборки.ДокументСборкаСсылка, ДокКорректировкаСборки);
				
			КонецЕсли;
			
			КоличествоКзачету = Мин(СтрокаНедостачиТовары.КоличествоНедостачи, СтрокаНедостачиСборки.Количество);
			
			Если КоличествоКзачету = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НовСтрокаТовары = ДокКорректировкаСборки.Товары.Добавить();
			НовСтрокаТовары.Номенклатура = СтрокаНедостачиСборки.Номенклатура;
			НовСтрокаТовары.ЗаказПокупателя = СтрокаНедостачиСборки.ЗаказПокупателя;
			НовСтрокаТовары.Количество = КоличествоКзачету;
			НовСтрокаТовары.Ячейка = ЯчейкаДляПеремещенияОтказовКлиентов;
			НовСтрокаТовары.Склад = СтрокаНедостачиСборки.Склад;
			НовСтрокаТовары.Причина = Перечисления.ПричиныКорректировкиСборки.ОтказКлиента;
			НовСтрокаТовары.ПроблемнаяЯчейка = СтрокаНедостачиСборки.Ячейка;
			
			СтрокаНедостачиТовары.КоличествоНедостачи = СтрокаНедостачиТовары.КоличествоНедостачи - КоличествоКзачету;
			СтрокаНедостачиСборки.Количество = СтрокаНедостачиСборки.Количество - КоличествоКзачету;
			
			Если СтрокаНедостачиТовары.КоличествоНедостачи = 0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если СтрокаНедостачиТовары.КоличествоНедостачи > 0 Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке("Не удалось распределить недостачу в корректировке сборки по номеклатуре " + СтруктураОтбораНоменклатураЗаказ.Номенклатура 
					+ ", заказу " + СтруктураОтбораНоменклатураЗаказ.ЗаказПокупателя + " в количестве = " + СтрокаНедостачиТовары.КоличествоНедостачи, Отказ);
					
		КонецЕсли;
		
	КонецЦикла;
	
	//свертка товаров
	Для Каждого ЭлДокументыСборки Из соотДокументыСборки Цикл
				
		ДокКорректировкаСборки = ЭлДокументыСборки.Значение;
		
		Если ДокКорректировкаСборки.Товары.Количество() > 0 Тогда
			
			тзТоварыДляСвертки = ДокКорректировкаСборки.Товары.Выгрузить();
			тзТоварыДляСвертки.Свернуть("Номенклатура, ЗаказПокупателя, Ячейка, Склад, Причина, ПроблемнаяЯчейка", "Количество");
			тзТоварыДляСвертки.Сортировать("Номенклатура, ЗаказПокупателя");
			
		КонецЕсли;
		
	КонецЦикла;
	
	//-Макрушин Е. 10.03.2026 #UT10-5689
	
КонецПроцедуры
	
Процедура СкорректироватьГрузовыеМеста(соотДокументыГрузовыеМеста, ДанныеДляКорректировкиГрузовогоМеста, ТаблицыНедостач, Отказ)
	
	//+Макрушин Е. 10.03.2026 #UT10-5689
	тзНедостачиГрузовыеМеста = ТаблицыНедостач.тзНедостачиГрузовыеМеста;
	
	СтруктураОтбораГрузовогоМеста = Новый Структура;
	СтруктураОтбораГрузовогоМеста.Вставить("Номенклатура", ДанныеДляКорректировкиГрузовогоМеста.Номенклатура);
	СтруктураОтбораГрузовогоМеста.Вставить("ЗаказПокупателя", ДанныеДляКорректировкиГрузовогоМеста.ЗаказПокупателя);
	СтруктураОтбораГрузовогоМеста.Вставить("Сборка", ДанныеДляКорректировкиГрузовогоМеста.Сборка);
	
	КоличествоНедостачи = ДанныеДляКорректировкиГрузовогоМеста.Количество;
	
	СтрокиНедостачиГрузовыеМеста = тзНедостачиГрузовыеМеста.НайтиСтроки(СтруктураОтбораГрузовогоМеста);
	
	Для Каждого СтрокаНедостачиГрузовыеМеста Из СтрокиНедостачиГрузовыеМеста Цикл
		
		ДокКорректировкаГрузовогоМеста = соотДокументыГрузовыеМеста.Получить(СтрокаНедостачиГрузовыеМеста.ДокументГрузовоеМестоСсылка);
		
		Если ДокКорректировкаГрузовогоМеста = Неопределено Тогда
			
			ДокКорректировкаГрузовогоМеста = Документы.КорректировкаГрузовогоМеста.СоздатьДокумент();  
			ДокКорректировкаГрузовогоМеста.Заполнить(СтрокаНедостачиГрузовыеМеста.ДокументГрузовоеМестоСсылка);
			ДокКорректировкаГрузовогоМеста.УстановитьНовыйНомер(ДокКорректировкаГрузовогоМеста.Организация.Префикс);
			ДокКорректировкаГрузовогоМеста.Исполнено = Истина;
			
			ДокКорректировкаГрузовогоМеста.Вставить(СтрокаНедостачиГрузовыеМеста.ДокументГрузовоеМестоСсылка, ДокКорректировкаГрузовогоМеста);
			
		КонецЕсли;
		
		СтруктураОтбораНоменклатураЗаказ = Новый Структура;
		СтруктураОтбораНоменклатураЗаказ.Вставить("Номенклатура", ДанныеДляКорректировкиГрузовогоМеста.Номенклатура);
		СтруктураОтбораНоменклатураЗаказ.Вставить("ЗаказПокупателя", ДанныеДляКорректировкиГрузовогоМеста.ЗаказПокупателя);
		
		СтрокиКорректировки = ДокКорректировкаГрузовогоМеста.Товары.НайтиСтроки(СтруктураОтбораНоменклатураЗаказ);
		
		Для Каждого СтрокаКорректировки Из СтрокиКорректировки Цикл
			
			КоличествоКЗачету = Мин(КоличествоНедостачи, СтрокаКорректировки.Количество);
			
			Если КоличествоКЗачету = 0 Тогда
				Продолжить;
			КонецЕсли;

			СтрокаКорректировки.Количество = СтрокаКорректировки.Количество + КоличествоКЗачету;
			СтрокаКорректировки.Факт = СтрокаКорректировки.Факт - КоличествоКЗачету;
			
			КоличествоНедостачи = КоличествоНедостачи - КоличествоКЗачету;
			
			Если ДанныеДляКорректировкиГрузовогоМеста.Свойство("КодМаркировки") Тогда
				
				СтрокаКодыМаркивроки = ДокКорректировкаГрузовогоМеста.КодыМаркировки.Добавить();
				СтрокаКодыМаркивроки.КодМаркировки = ДанныеДляКорректировкиГрузовогоМеста.КодМаркировки;
				
            КонецЕсли;
			
		КонецЦикла;
		
		Если КоличествоНедостачи = 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;	
		
	Если КоличествоНедостачи > 0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не удалось распределить недостачу в корректировке грузового места по сборке " + ДанныеДляКорректировкиГрузовогоМеста.Сборка + Символы.ПС 
				+ " 	по номеклатуре " + ДанныеДляКорректировкиГрузовогоМеста.Номенклатура + Символы.ПС
				+ "		по заказу " + ДанныеДляКорректировкиГрузовогоМеста.ЗаказПокупателя + " в количестве = " + КоличествоНедостачи, Отказ);
	КонецЕсли;
	//-Макрушин Е. 10.03.2026 #UT10-5689
	
КонецПроцедуры

Функция СоздатьКорректировкуРеализации(Отказ)
	
	//+Макрушин Е. 10.03.2026 #UT10-5689
	ДокКорректировкаРТУ = Документы.КорректировкаРеализации.СоздатьДокумент();
	
	ДокКорректировкаРТУ.Заполнить(ДокументОснование);
	ДокКорректировкаРТУ.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
	ДокКорректировкаРТУ.УстановитьНовыйНомер(ДокКорректировкаРТУ.Организация.Префикс);
	
	Для каждого СтрокаТовары Из Товары Цикл
	
		Если СтрокаТовары.КоличествоРасхождения < 0 Тогда
			
			//недостача
			ОбщееКоличествоКИзменению = -СтрокаТовары.КоличествоРасхождения;
			СтрокаТовары = ДокКорректировкаРТУ.Товары.НайтиСтроки(Новый Структура("Номенклатура, ЗаказПокупателя", СтрокаТовары.Номенклатура, СтрокаТовары.ЗаказПокупателя)); 
			
			Для Каждого СтрокаТовары Из СтрокаТовары Цикл
				
				КоличествоКИзменению = Мин(СтрокаТовары.Количество, ОбщееКоличествоКИзменению);
				
				СтрокаТовары.Количество = СтрокаТовары.Количество - КоличествоКИзменению;
				ОбщееКоличествоКИзменению = ОбщееКоличествоКИзменению - КоличествоКИзменению;
				
				СтрокаТовары.ОтражатьТоварныйУчет = Истина;
					
				ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТовары, ДокКорректировкаРТУ);
				ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТовары, ДокКорректировкаРТУ);
				ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТовары, ДокКорректировкаРТУ);
					
				Если ОбщееКоличествоКИзменению = 0 Тогда
					Прервать;
				КонецЕсли;	
				
			КонецЦикла;
			
			Если ОбщееКоличествоКИзменению <> 0 Тогда
				
				ОбщегоНазначения.СообщитьОбОшибке("Не удалось скорректировать " + ДокументОснование + " по номенклатуре " 
					+ СтрокаТовары.Номенклатура + " и заказу " + СтрокаТовары.ЗаказПокупателя 
					+ " на -"  + ОбщееКоличествоКИзменению + " " + СтрокаТовары.ЕдиницаИзмерения, Отказ); 
					
			КонецЕсли;
			
		ИначеЕсли СтрокаТовары.КоличествоРасхождения > 0 Тогда
			
			//излишек
			НовСтрокаТовары = ДокКорректировкаРТУ.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрокаТовары, СтрокаТовары);
			НовСтрокаТовары.ЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();
			НовСтрокаТовары.СпособСписанияОстаткаТоваров = Перечисления.СпособыСписанияОстаткаТоваров.СоСклада;
			НовСтрокаТовары.Склад = СтрокаТовары.Склад;
			НовСтрокаТовары.Количество = СтрокаТовары.КоличествоРасхождения;
			НовСтрокаТовары.ОтражатьТоварныйУчет = Истина;
			
			ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(НовСтрокаТовары, ДокКорректировкаРТУ);
			ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(НовСтрокаТовары, ДокКорректировкаРТУ);
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НовСтрокаТовары, ДокКорректировкаРТУ);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НовСтрокаТовары, ДокКорректировкаРТУ);
					
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаРасхожденияКМ Из РасхожденияКМ Цикл
		
		НовСтрокаКМ = ДокКорректировкаРТУ.КодыМаркировки.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрокаКМ, СтрокаРасхожденияКМ); 
		
	КонецЦикла;
	
	Возврат ДокКорректировкаРТУ;
	//-Макрушин Е. 10.03.2026 #UT10-5689
	
КонецФункции

Функция ТекстЗапросаРасхожденияДляКорректировкиСборокЗаказовПокупатей()
	
	//+Макрушин Е. 05.03.2026 #UT10-5689
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АктОРасхожденияхПослеОтгрузкиТовары.Номенклатура КАК Номенклатура,
		|	АктОРасхожденияхПослеОтгрузкиТовары.ЗаказПокупателя КАК ЗаказПокупателя,
		|	СУММА(-АктОРасхожденияхПослеОтгрузкиТовары.КоличествоРасхождения) КАК КоличествоНедостачи,
		|	АктОРасхожденияхПослеОтгрузкиТовары.Склад
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	Документ.АктОРасхожденияхПослеОтгрузки.Товары КАК АктОРасхожденияхПослеОтгрузкиТовары
		|ГДЕ
		|	АктОРасхожденияхПослеОтгрузкиТовары.Ссылка = &Ссылка
		|	И АктОРасхожденияхПослеОтгрузкиТовары.КоличествоРасхождения < 0
		|
		|СГРУППИРОВАТЬ ПО
		|	АктОРасхожденияхПослеОтгрузкиТовары.ЗаказПокупателя,
		|	АктОРасхожденияхПослеОтгрузкиТовары.Номенклатура,
		|	АктОРасхожденияхПослеОтгрузкиТовары.Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АктОРасхожденияхПослеОтгрузкиРасхожденияКМ.Номенклатура КАК Номенклатура,
		|	АктОРасхожденияхПослеОтгрузкиРасхожденияКМ.КодМаркировки КАК КодМаркировки,
		|	СборкаЗаказовПокупателяКодыМаркировки.Ссылка КАК ДокументСборкаСсылка
		|ИЗ
		|	Документ.АктОРасхожденияхПослеОтгрузки.РасхожденияКМ КАК АктОРасхожденияхПослеОтгрузкиРасхожденияКМ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СборкаЗаказовПокупателя.КодыМаркировки КАК СборкаЗаказовПокупателяКодыМаркировки
		|		ПО АктОРасхожденияхПослеОтгрузкиРасхожденияКМ.КодМаркировки = СборкаЗаказовПокупателяКодыМаркировки.КодМаркировки
		|			И (СборкаЗаказовПокупателяКодыМаркировки.Ссылка.Проведен)
		|ГДЕ
		|	АктОРасхожденияхПослеОтгрузкиРасхожденияКМ.Ссылка = &Ссылка
		|	И АктОРасхожденияхПослеОтгрузкиРасхожденияКМ.Недостача
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументСборкаСсылка,
		|	Номенклатура,
		|	КодМаркировки
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура,
		|	ВТ_Товары.ЗаказПокупателя,
		|	СУММА(ВТ_Товары.КоличествоНедостачи) КАК КоличествоНедостачи
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Товары.Номенклатура,
		|	ВТ_Товары.ЗаказПокупателя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СборкаЗаказовПокупателяЗаказано.Ссылка КАК ДокументСборкаСсылка,
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.ЗаказПокупателя КАК ЗаказПокупателя,
		|	СборкаЗаказовПокупателяЗаказано.Ячейка,
		|	ВТ_Товары.Склад,
		|	СУММА(СборкаЗаказовПокупателяЗаказано.Факт) КАК Количество
		|ПОМЕСТИТЬ ВТ_ТоварыСоСвязаннойСборкой
		|ИЗ
		|	Документ.СборкаЗаказовПокупателя.Заказано КАК СборкаЗаказовПокупателяЗаказано
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Товары КАК ВТ_Товары
		|		ПО СборкаЗаказовПокупателяЗаказано.Заказ = ВТ_Товары.ЗаказПокупателя
		|			И СборкаЗаказовПокупателяЗаказано.Номенклатура = ВТ_Товары.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	СборкаЗаказовПокупателяЗаказано.Ссылка,
		|	ВТ_Товары.Номенклатура,
		|	ВТ_Товары.ЗаказПокупателя,
		|	СборкаЗаказовПокупателяЗаказано.Ячейка,
		|	ВТ_Товары.Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ТоварыСоСвязаннойСборкой.ДокументСборкаСсылка,
		|	ВТ_ТоварыСоСвязаннойСборкой.Номенклатура,
		|	ВТ_ТоварыСоСвязаннойСборкой.ЗаказПокупателя,
		|	ВТ_ТоварыСоСвязаннойСборкой.Ячейка,
		|	ВТ_ТоварыСоСвязаннойСборкой.Склад,
		|	СУММА(ВТ_ТоварыСоСвязаннойСборкой.Количество) КАК Количество
		|ИЗ
		|	ВТ_ТоварыСоСвязаннойСборкой КАК ВТ_ТоварыСоСвязаннойСборкой
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТоварыСоСвязаннойСборкой.ЗаказПокупателя,
		|	ВТ_ТоварыСоСвязаннойСборкой.Ячейка,
		|	ВТ_ТоварыСоСвязаннойСборкой.Склад,
		|	ВТ_ТоварыСоСвязаннойСборкой.ДокументСборкаСсылка,
		|	ВТ_ТоварыСоСвязаннойСборкой.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ГрузовоеМестоТовары.Ссылка КАК ДокументГрузовоеМестоСсылка,
		|	ВТ_ТоварыСоСвязаннойСборкой.ДокументСборкаСсылка,
		|	ВТ_ТоварыСоСвязаннойСборкой.Номенклатура,
		|	ВТ_ТоварыСоСвязаннойСборкой.ЗаказПокупателя
		|ИЗ
		|	ВТ_ТоварыСоСвязаннойСборкой КАК ВТ_ТоварыСоСвязаннойСборкой
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ГрузовоеМесто.Товары КАК ГрузовоеМестоТовары
		|		ПО ВТ_ТоварыСоСвязаннойСборкой.ДокументСборкаСсылка = ГрузовоеМестоТовары.Ссылка.Сборка
		|			И ВТ_ТоварыСоСвязаннойСборкой.Номенклатура = ГрузовоеМестоТовары.Номенклатура
		|			И ВТ_ТоварыСоСвязаннойСборкой.ЗаказПокупателя = ГрузовоеМестоТовары.Заказ";
	
	Возврат ТекстЗапроса;
	//-Макрушин Е. 05.03.2026 #UT10-5689
	
КонецФункции

Функция ДоступноОформлениеДокументов() Экспорт
	
	//+Макрушин Е. 04.03.2026 #UT10-5689
	ДоступноОформление = Ложь;

	Если ЗначениеЗаполнено(ВидОперации) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТаблицаТоварыАкта.Номенклатура,
		               |	ТаблицаТоварыАкта.Количество
		               |ПОМЕСТИТЬ ВТ_ТоварыАкта
		               |ИЗ
		               |	&ТаблицаТоварыАкта КАК ТаблицаТоварыАкта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ВложенныйЗапрос.Номенклатура,
		               |	СУММА(ВложенныйЗапрос.Количество) КАК Количество,
		               |	СУММА(ВложенныйЗапрос.КоличествоАкта) КАК КоличествоАкта
		               |ПОМЕСТИТЬ ВТ_Сводная
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		               |		РеализацияТоваровУслугТовары.Количество КАК Количество,
		               |		0 КАК КоличествоАкта
		               |	ИЗ
		               |		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		               |	ГДЕ
		               |		РеализацияТоваровУслугТовары.Ссылка = &ДокументОснование
		               |		И НЕ РеализацияТоваровУслугТовары.Ссылка.ПометкаУдаления
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		ВТ_ТоварыАкта.Номенклатура,
		               |		0,
		               |		ВТ_ТоварыАкта.Количество
		               |	ИЗ
		               |		ВТ_ТоварыАкта КАК ВТ_ТоварыАкта) КАК ВложенныйЗапрос
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВложенныйЗапрос.Номенклатура
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Сводная.Номенклатура КАК Номенклатура,
		               |	ВТ_Сводная.Количество,
		               |	ВТ_Сводная.КоличествоАкта
		               |ИЗ
		               |	ВТ_Сводная КАК ВТ_Сводная
		               |ГДЕ
		               |	ВТ_Сводная.Количество <> ВТ_Сводная.КоличествоАкта
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Номенклатура
		               |АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
		Запрос.УстановитьПараметр("ТаблицаТоварыАкта", Товары.Выгрузить(, "Номенклатура, Количество"));
		
		Если ВидОперации = Перечисления.ВидыОперацийАктОРасхожденияхПослеОтгрузки.Продажа Тогда
            Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.РеализацияТоваровУслуг", "Документ.КорректировкаРеализации");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "РеализацияТоваровУслугТовары.Ссылка = &ДокументОснование", "РеализацияТоваровУслугТовары.Ссылка.ДокументРеализации = &ДокументОснование");
		КонецЕсли;
		
		РезультатПакет = Запрос.ВыполнитьПакет();
		тзРазница = РезультатПакет[2].Выгрузить();
		
		Если тзРазница.Количество() > 0 Тогда
			ДоступноОформление = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДоступноОформление;
	//-Макрушин Е. 04.03.2026 #UT10-5689
	
КонецФункции


мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");

мПараметрыСвязиСтрокТЧ = Новый Соответствие;
мПараметрыСвязиСтрокТЧ.Вставить("Товары", Новый Структура("СвободныйКлюч, ФлагМодификации", Неопределено, Ложь));

мСтруктураПараметровВзаиморасчетов = Новый Структура;
мСтруктураПараметровВзаиморасчетов.Вставить("СтруктураТабличныхЧастей", Новый Структура("Товары"));
мСтруктураПараметровВзаиморасчетов.Вставить("Направление", "Поступление");
мСтруктураПараметровВзаиморасчетов.Вставить("ЕстьЗаказыВТабличныхЧастях", Истина);
мСтруктураПараметровВзаиморасчетов.Вставить("ИмяЗаказаВТабличныхЧастях", "ЗаказПоставщику");

мСтруктураПараметровДляПолученияДоговора = ЗаполнениеДокументов.ПолучитьСтруктуруПараметровДляПолученияДоговораПокупки();

УказаниеСкладов = глЗначениеПеременной("УказаниеСкладовВТабличнойЧастиДокументов");

мУказаниеСкладовВТЧ = (УказаниеСкладов = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовПоступленияРеализации)
Или (УказаниеСкладов = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовПоступления);
